data = [['принтер', 7100, 1], ['компьютер', 75000, 1], ['принтер', 3500, 8], ['клавиатура', 950, 15],
        ['веб-камера', 920, 8], ['монитор', 30000, 9], ['сканер', 7900, 15], ['веб-камера', 810, 9],
        ['компьютер', 57000, 5], ['компьютер', 46000, 1], ['мышь', 870, 1], ['монитор', 56000, 5],
        ['монитор', 47000, 3], ['сканер', 7800, 5], ['мышь', 730, 4], ['принтер', 43000, 10],
        ['клавиатура', 600, 2], ['сканер', 8400, 5], ['монитор', 74000, 3], ['принтер', 59000, 8],
        ['принтер', 30000, 15], ['клавиатура', 1200, 10], ['клавиатура', 1400, 4], ['компьютер', 75000, 8],
        ['принтер', 96000, 9]]
unique_list = []
for item in data:
    found = False
    for unique_item in unique_list:
        if item[0] == unique_item[0]:
            unique_item[1] += item[1]*item[2]
            unique_item[2] += item[2]
            found = True
            break
    if not found:
        unique_list.append(item[:])
total = 0
i = 1
for i, elements in enumerate(unique_list):
    print(f'{i+1:2}. {elements[0]:10}: {elements[1]:10d} р. {elements[2]:5} шт.')